#include <stdio.h>

int main(){
    int n1,n2,n3,n4,n5,n6,n7,n8,n9,n10,n11,n12,n13,n14,n15,n16;

    int n,m,sum,s;
    int q,i;

    scanf("%d",&q); //輸入測資數量

    for (i = 1;i <= q;i++){ //跑q次

        scanf("%1d%1d%1d%1d %1d%1d%1d%1d %1d%1d%1d%1d %1d%1d%1d%1d",&n1,&n2,&n3,&n4,&n5,&n6,&n7,&n8,&n9,&n10,&n11,&n12,&n13,&n14,&n15,&n16);
        //輸入信用卡卡號
        m = n2+n4+n6+n8+n10+n12+n14+n16; //將奇數位置數字加總

        int s2,s4,s6,s8,s10,s12,s14,s16;//將偶數位置數字加總*2以後的十位數字 (n*2/10)*2以後的個位數字(n*2-(n*2/10)*10)

        s2 = (n1*2/10)+(n1*2-(n1*2/10)*10);
        s4 = (n3*2/10)+(n3*2-(n3*2/10)*10);
        s6 = (n5*2/10)+(n5*2-(n5*2/10)*10);
        s8 = (n7*2/10)+(n7*2-(n7*2/10)*10);
        s10 = (n9*2/10)+(n9*2-(n9*2/10)*10);
        s12 = (n11*2/10)+(n11*2-(n11*2/10)*10);
        s14 = (n13*2/10)+(n13*2-(n13*2/10)*10);
        s16 = (n15*2/10)+(n15*2-(n15*2/10)*10);


        n = s2+s4+s6+s8+s10+s12+s14+s16;

        sum = m+n;

        if (sum%10 == 0){  //判斷最後加總是否個位數字=0
            printf("Valid\n");
        }
        else{
            printf("Invalid\n");
        }

    }






}
